artillery_load_test/optimization-stress.yml
config:
  target: "https://routing.trya.space/v1"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "1 req/sec - 1 min."
    - duration: 60
      arrivalRate: 2
      name: "2 reqs/sec - 1 min."

scenarios:
  - name: "Get Drive-Bike Route"
    flow:
      - post:
          url: "/get_drive_bike_route?origin_lat=47.7930&origin_lng=-122.3584&dest_lat=47.6057&dest_lng=-122.3336"