artillery_load_test/optimization-stress.yml
config:
  target: "https://routing.trya.space/v1"
  phases:
    - duration: 60
      arrivalRate: 4
      name: "4 reqs/sec - 1 min"
    - duration: 60
      arrivalRate: 8
      name: "8 reqs/sec - 1 min"
    - duration: 60
      arrivalRate: 12
      name: "12 reqs/sec - 1 min"
    - duration: 60
      arrivalRate: 16
      name: "16 reqs/sec - 1 min"

scenarios:
  - name: "Get Drive-Bike Route"
    flow:
      - post:
          url: "/get_drive_walk_route?origin_lat=47.7930&origin_lng=-122.3584&dest_lat=47.6057&dest_lng=-122.3336"