artillery_load_test/optimization-stress.yml
config:
  target: "https://routing.trya.space/v1"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "5 reqs/sec - 1 min"
    - duration: 60
      arrivalRate: 10
      name: "10 reqs/sec - 1 min"
    - duration: 60
      arrivalRate: 15
      name: "15 reqs/sec - 1 min"
    - duration: 60
      arrivalRate: 20
      name: "20 reqs/sec - 1 min"

scenarios:
  - name: "Get Drive-Bike Route"
    flow:
      - post:
          url: "/get_drive_walk_route?origin_lat=47.7930&origin_lng=-122.3584&dest_lat=47.6057&dest_lng=-122.3336"